; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-3-4-10)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	truck4 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	package9 - obj
	package10 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	p0-1 - location
	p0-7 - location
	p1-2 - location
	p1-6 - location
	p1-7 - location
	p2-0 - location
	p2-1 - location
	p2-3 - location
	p2-4 - location
	p2-5 - location
	p3-6 - location
	p4-5 - location
	p4-7 - location
	p7-0 - location
	p7-6 - location
	)
	(:init
	(at driver1 s2)
	(at driver2 s5)
	(at driver3 s4)
	(at truck1 s2)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s2)
	(empty truck3)
	(at truck4 s2)
	(empty truck4)
	(at package1 s7)
	(at package2 s0)
	(at package3 s0)
	(at package4 s2)
	(at package5 s7)
	(at package6 s4)
	(at package7 s3)
	(at package8 s4)
	(at package9 s6)
	(at package10 s0)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 68)
	(= (time-to-walk p0-1 s0) 68)
	(= (time-to-walk s1 p0-1) 60)
	(= (time-to-walk p0-1 s1) 60)
	(path s0 p0-7)
	(path p0-7 s0)
	(path s7 p0-7)
	(path p0-7 s7)
	(= (time-to-walk s0 p0-7) 44)
	(= (time-to-walk p0-7 s0) 44)
	(= (time-to-walk s7 p0-7) 46)
	(= (time-to-walk p0-7 s7) 46)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 73)
	(= (time-to-walk p1-2 s1) 73)
	(= (time-to-walk s2 p1-2) 55)
	(= (time-to-walk p1-2 s2) 55)
	(path s1 p1-6)
	(path p1-6 s1)
	(path s6 p1-6)
	(path p1-6 s6)
	(= (time-to-walk s1 p1-6) 36)
	(= (time-to-walk p1-6 s1) 36)
	(= (time-to-walk s6 p1-6) 83)
	(= (time-to-walk p1-6 s6) 83)
	(path s1 p1-7)
	(path p1-7 s1)
	(path s7 p1-7)
	(path p1-7 s7)
	(= (time-to-walk s1 p1-7) 32)
	(= (time-to-walk p1-7 s1) 32)
	(= (time-to-walk s7 p1-7) 25)
	(= (time-to-walk p1-7 s7) 25)
	(path s2 p2-0)
	(path p2-0 s2)
	(path s0 p2-0)
	(path p2-0 s0)
	(= (time-to-walk s2 p2-0) 14)
	(= (time-to-walk p2-0 s2) 14)
	(= (time-to-walk s0 p2-0) 36)
	(= (time-to-walk p2-0 s0) 36)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 85)
	(= (time-to-walk p2-3 s2) 85)
	(= (time-to-walk s3 p2-3) 1)
	(= (time-to-walk p2-3 s3) 1)
	(path s2 p2-4)
	(path p2-4 s2)
	(path s4 p2-4)
	(path p2-4 s4)
	(= (time-to-walk s2 p2-4) 10)
	(= (time-to-walk p2-4 s2) 10)
	(= (time-to-walk s4 p2-4) 28)
	(= (time-to-walk p2-4 s4) 28)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 63)
	(= (time-to-walk p2-5 s2) 63)
	(= (time-to-walk s5 p2-5) 45)
	(= (time-to-walk p2-5 s5) 45)
	(path s3 p3-6)
	(path p3-6 s3)
	(path s6 p3-6)
	(path p3-6 s6)
	(= (time-to-walk s3 p3-6) 42)
	(= (time-to-walk p3-6 s3) 42)
	(= (time-to-walk s6 p3-6) 12)
	(= (time-to-walk p3-6 s6) 12)
	(path s4 p4-5)
	(path p4-5 s4)
	(path s5 p4-5)
	(path p4-5 s5)
	(= (time-to-walk s4 p4-5) 14)
	(= (time-to-walk p4-5 s4) 14)
	(= (time-to-walk s5 p4-5) 96)
	(= (time-to-walk p4-5 s5) 96)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(= (time-to-walk s4 p4-7) 64)
	(= (time-to-walk p4-7 s4) 64)
	(= (time-to-walk s7 p4-7) 19)
	(= (time-to-walk p4-7 s7) 19)
	(path s7 p7-6)
	(path p7-6 s7)
	(path s6 p7-6)
	(path p7-6 s6)
	(= (time-to-walk s7 p7-6) 24)
	(= (time-to-walk p7-6 s7) 24)
	(= (time-to-walk s6 p7-6) 46)
	(= (time-to-walk p7-6 s6) 46)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 53)
	(= (time-to-drive s3 s0) 53)
	(link s0 s7)
	(link s7 s0)
	(= (time-to-drive s0 s7) 12)
	(= (time-to-drive s7 s0) 12)
	(link s1 s0)
	(link s0 s1)
	(= (time-to-drive s1 s0) 47)
	(= (time-to-drive s0 s1) 47)
	(link s1 s2)
	(link s2 s1)
	(= (time-to-drive s1 s2) 19)
	(= (time-to-drive s2 s1) 19)
	(link s1 s6)
	(link s6 s1)
	(= (time-to-drive s1 s6) 89)
	(= (time-to-drive s6 s1) 89)
	(link s1 s7)
	(link s7 s1)
	(= (time-to-drive s1 s7) 14)
	(= (time-to-drive s7 s1) 14)
	(link s3 s4)
	(link s4 s3)
	(= (time-to-drive s3 s4) 79)
	(= (time-to-drive s4 s3) 79)
	(link s3 s5)
	(link s5 s3)
	(= (time-to-drive s3 s5) 33)
	(= (time-to-drive s5 s3) 33)
	(link s3 s6)
	(link s6 s3)
	(= (time-to-drive s3 s6) 59)
	(= (time-to-drive s6 s3) 59)
	(link s4 s1)
	(link s1 s4)
	(= (time-to-drive s4 s1) 51)
	(= (time-to-drive s1 s4) 51)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 87)
	(= (time-to-drive s6 s4) 87)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 94)
	(= (time-to-drive s2 s5) 94)
	(link s5 s4)
	(link s4 s5)
	(= (time-to-drive s5 s4) 33)
	(= (time-to-drive s4 s5) 33)
	(link s5 s6)
	(link s6 s5)
	(= (time-to-drive s5 s6) 19)
	(= (time-to-drive s6 s5) 19)
	(link s6 s0)
	(link s0 s6)
	(= (time-to-drive s6 s0) 18)
	(= (time-to-drive s0 s6) 18)
	(link s7 s3)
	(link s3 s7)
	(= (time-to-drive s7 s3) 46)
	(= (time-to-drive s3 s7) 46)
	(link s7 s5)
	(link s5 s7)
	(= (time-to-drive s7 s5) 54)
	(= (time-to-drive s5 s7) 54)
	(link s7 s6)
	(link s6 s7)
	(= (time-to-drive s7 s6) 2)
	(= (time-to-drive s6 s7) 2)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver1 s5)
	(at driver2 s6)
	(at driver3 s5)
	(at truck4 s7)
	(at package1 s5)
	(at package2 s0)
	(at package3 s6)
	(at package4 s0)
	(at package5 s5)
	(at package6 s2)
	(at package7 s5)
	(at package8 s0)
	(at package9 s2)
	(at package10 s5)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 3  (driven))) (* 2  (walked))))

)

; plan
1. (board-truck driver1 truck4 s2)
   deleted: (at driver1 s2) (empty truck4)
   added: (driving driver1 truck4)
   goals met: 1 of 14
2. (drive-truck truck4 s2 s5 driver1)
   deleted: (at truck4 s2)
   added: (at truck4 s5)
   changed: (driven) from 0 to 94
   goals met: 1 of 14
3. (walk driver3 s4 p4-5)
   deleted: (at driver3 s4)
   added: (at driver3 p4-5)
   changed: (walked) from 0 to 14
   goals met: 1 of 14
4. (walk driver3 p4-5 s5)
   deleted: (at driver3 p4-5)
   added: (at driver3 s5)
   changed: (walked) from 14 to 110
   goals met: 2 of 14
5. (drive-truck truck4 s5 s6 driver1)
   deleted: (at truck4 s5)
   added: (at truck4 s6)
   changed: (driven) from 94 to 113
   goals met: 2 of 14
6. (load-truck package9 truck4 s6)
   deleted: (at package9 s6)
   added: (in package9 truck4)
   goals met: 2 of 14
7. (drive-truck truck4 s6 s3 driver1)
   deleted: (at truck4 s6)
   added: (at truck4 s3)
   changed: (driven) from 113 to 172
   goals met: 2 of 14
8. (load-truck package7 truck4 s3)
   deleted: (at package7 s3)
   added: (in package7 truck4)
   goals met: 2 of 14
9. (drive-truck truck4 s3 s5 driver1)
   deleted: (at truck4 s3)
   added: (at truck4 s5)
   changed: (driven) from 172 to 205
   goals met: 2 of 14
10. (unload-truck package7 truck4 s5)
   deleted: (in package7 truck4)
   added: (at package7 s5)
   goals met: 3 of 14
11. (disembark-truck driver1 truck4 s5)
   deleted: (driving driver1 truck4)
   added: (at driver1 s5) (empty truck4)
   goals met: 4 of 14
12. (board-truck driver3 truck4 s5)
   deleted: (at driver3 s5) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 3 of 14
13. (drive-truck truck4 s5 s4 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s4)
   changed: (driven) from 205 to 238
   goals met: 3 of 14
14. (load-truck package6 truck4 s4)
   deleted: (at package6 s4)
   added: (in package6 truck4)
   goals met: 3 of 14
15. (load-truck package8 truck4 s4)
   deleted: (at package8 s4)
   added: (in package8 truck4)
   goals met: 3 of 14
16. (drive-truck truck4 s4 s6 driver3)
   deleted: (at truck4 s4)
   added: (at truck4 s6)
   changed: (driven) from 238 to 325
   goals met: 3 of 14
17. (drive-truck truck4 s6 s7 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s7)
   changed: (driven) from 325 to 327
   goals met: 4 of 14
18. (load-truck package1 truck4 s7)
   deleted: (at package1 s7)
   added: (in package1 truck4)
   goals met: 4 of 14
19. (load-truck package5 truck4 s7)
   deleted: (at package5 s7)
   added: (in package5 truck4)
   goals met: 4 of 14
20. (drive-truck truck4 s7 s5 driver3)
   deleted: (at truck4 s7)
   added: (at truck4 s5)
   changed: (driven) from 327 to 381
   goals met: 3 of 14
21. (unload-truck package1 truck4 s5)
   deleted: (in package1 truck4)
   added: (at package1 s5)
   goals met: 4 of 14
22. (unload-truck package5 truck4 s5)
   deleted: (in package5 truck4)
   added: (at package5 s5)
   goals met: 5 of 14
23. (drive-truck truck4 s5 s2 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s2)
   changed: (driven) from 381 to 475
   goals met: 5 of 14
24. (unload-truck package6 truck4 s2)
   deleted: (in package6 truck4)
   added: (at package6 s2)
   goals met: 6 of 14
25. (unload-truck package9 truck4 s2)
   deleted: (in package9 truck4)
   added: (at package9 s2)
   goals met: 7 of 14
26. (load-truck package4 truck4 s2)
   deleted: (at package4 s2)
   added: (in package4 truck4)
   goals met: 7 of 14
27. (drive-truck truck4 s2 s5 driver3)
   deleted: (at truck4 s2)
   added: (at truck4 s5)
   changed: (driven) from 475 to 569
   goals met: 7 of 14
28. (drive-truck truck4 s5 s6 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s6)
   changed: (driven) from 569 to 588
   goals met: 7 of 14
29. (disembark-truck driver3 truck4 s6)
   deleted: (driving driver3 truck4)
   added: (at driver3 s6) (empty truck4)
   goals met: 7 of 14
30. (walk driver2 s5 p4-5)
   deleted: (at driver2 s5)
   added: (at driver2 p4-5)
   changed: (walked) from 110 to 206
   goals met: 7 of 14
31. (board-truck driver3 truck4 s6)
   deleted: (at driver3 s6) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 7 of 14
32. (drive-truck truck4 s6 s0 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s0)
   changed: (driven) from 588 to 606
   goals met: 7 of 14
33. (unload-truck package8 truck4 s0)
   deleted: (in package8 truck4)
   added: (at package8 s0)
   goals met: 8 of 14
34. (load-truck package10 truck4 s0)
   deleted: (at package10 s0)
   added: (in package10 truck4)
   goals met: 8 of 14
35. (unload-truck package4 truck4 s0)
   deleted: (in package4 truck4)
   added: (at package4 s0)
   goals met: 9 of 14
36. (load-truck package3 truck4 s0)
   deleted: (at package3 s0)
   added: (in package3 truck4)
   goals met: 9 of 14
37. (drive-truck truck4 s0 s7 driver3)
   deleted: (at truck4 s0)
   added: (at truck4 s7)
   changed: (driven) from 606 to 618
   goals met: 10 of 14
38. (drive-truck truck4 s7 s5 driver3)
   deleted: (at truck4 s7)
   added: (at truck4 s5)
   changed: (driven) from 618 to 672
   goals met: 9 of 14
39. (unload-truck package10 truck4 s5)
   deleted: (in package10 truck4)
   added: (at package10 s5)
   goals met: 10 of 14
40. (drive-truck truck4 s5 s6 driver3)
   deleted: (at truck4 s5)
   added: (at truck4 s6)
   changed: (driven) from 672 to 691
   goals met: 10 of 14
41. (disembark-truck driver3 truck4 s6)
   deleted: (driving driver3 truck4)
   added: (at driver3 s6) (empty truck4)
   goals met: 10 of 14
42. (walk driver2 p4-5 s4)
   deleted: (at driver2 p4-5)
   added: (at driver2 s4)
   changed: (walked) from 206 to 220
   goals met: 10 of 14
43. (walk driver2 s4 p4-7)
   deleted: (at driver2 s4)
   added: (at driver2 p4-7)
   changed: (walked) from 220 to 284
   goals met: 10 of 14
44. (board-truck driver3 truck4 s6)
   deleted: (at driver3 s6) (empty truck4)
   added: (driving driver3 truck4)
   goals met: 10 of 14
45. (drive-truck truck4 s6 s7 driver3)
   deleted: (at truck4 s6)
   added: (at truck4 s7)
   changed: (driven) from 691 to 693
   goals met: 11 of 14
46. (disembark-truck driver3 truck4 s7)
   deleted: (driving driver3 truck4)
   added: (at driver3 s7) (empty truck4)
   goals met: 11 of 14
47. (walk driver2 p4-7 s7)
   deleted: (at driver2 p4-7)
   added: (at driver2 s7)
   changed: (walked) from 284 to 303
   goals met: 11 of 14
48. (board-truck driver2 truck4 s7)
   deleted: (at driver2 s7) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 11 of 14
49. (drive-truck truck4 s7 s6 driver2)
   deleted: (at truck4 s7)
   added: (at truck4 s6)
   changed: (driven) from 693 to 695
   goals met: 10 of 14
50. (unload-truck package3 truck4 s6)
   deleted: (in package3 truck4)
   added: (at package3 s6)
   goals met: 11 of 14
51. (disembark-truck driver2 truck4 s6)
   deleted: (driving driver2 truck4)
   added: (at driver2 s6) (empty truck4)
   goals met: 12 of 14
52. (walk driver3 s7 p4-7)
   deleted: (at driver3 s7)
   added: (at driver3 p4-7)
   changed: (walked) from 303 to 322
   goals met: 12 of 14
53. (board-truck driver2 truck4 s6)
   deleted: (at driver2 s6) (empty truck4)
   added: (driving driver2 truck4)
   goals met: 11 of 14
54. (drive-truck truck4 s6 s7 driver2)
   deleted: (at truck4 s6)
   added: (at truck4 s7)
   changed: (driven) from 695 to 697
   goals met: 12 of 14
55. (disembark-truck driver2 truck4 s7)
   deleted: (driving driver2 truck4)
   added: (at driver2 s7) (empty truck4)
   goals met: 12 of 14
56. (walk driver2 s7 p7-6)
   deleted: (at driver2 s7)
   added: (at driver2 p7-6)
   changed: (walked) from 322 to 346
   goals met: 12 of 14
57. (walk driver2 p7-6 s6)
   deleted: (at driver2 p7-6)
   added: (at driver2 s6)
   changed: (walked) from 346 to 392
   goals met: 13 of 14
58. (walk driver3 p4-7 s4)
   deleted: (at driver3 p4-7)
   added: (at driver3 s4)
   changed: (walked) from 392 to 456
   goals met: 13 of 14
59. (walk driver3 s4 p4-5)
   deleted: (at driver3 s4)
   added: (at driver3 p4-5)
   changed: (walked) from 456 to 470
   goals met: 13 of 14
60. (walk driver3 p4-5 s5)
   deleted: (at driver3 p4-5)
   added: (at driver3 s5)
   changed: (walked) from 470 to 566
   goals met: 14 of 14
